report_1000_users_duration/statistics.json
{
  "Get Character by ID" : {
    "transaction" : "Get Character by ID",
    "sampleCount" : 18563,
    "errorCount" : 14115,
    "errorPct" : 76.03835,
    "meanResTime" : 276.73630339923596,
    "medianResTime" : 73.0,
    "minResTime" : 0.0,
    "maxResTime" : 10855.0,
    "pct1ResTime" : 843.0,
    "pct2ResTime" : 1410.7999999999993,
    "pct3ResTime" : 2738.0000000000146,
    "throughput" : 515.9541942298072,
    "receivedKBytesPerSec" : 942.1136321588888,
    "sentKBytesPerSec" : 26.498724046639612
  },
  "Delete Character" : {
    "transaction" : "Delete Character",
    "sampleCount" : 18165,
    "errorCount" : 13910,
    "errorPct" : 76.575836,
    "meanResTime" : 266.6673823286532,
    "medianResTime" : 73.0,
    "minResTime" : 0.0,
    "maxResTime" : 10513.0,
    "pct1ResTime" : 807.1999999999989,
    "pct2ResTime" : 1409.0,
    "pct3ResTime" : 1910.3400000000001,
    "throughput" : 508.538633818589,
    "receivedKBytesPerSec" : 929.2497692556691,
    "sentKBytesPerSec" : 29.845740306550955
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 92725,
    "errorCount" : 70277,
    "errorPct" : 75.79078,
    "meanResTime" : 269.2731410083598,
    "medianResTime" : 82.0,
    "minResTime" : 0.0,
    "maxResTime" : 11000.0,
    "pct1ResTime" : 639.0,
    "pct2ResTime" : 1298.9500000000007,
    "pct3ResTime" : 3926.0,
    "throughput" : 2552.0173941762537,
    "receivedKBytesPerSec" : 11232.737496000645,
    "sentKBytesPerSec" : 155.9368248403699
  },
  "Create Character" : {
    "transaction" : "Create Character",
    "sampleCount" : 18733,
    "errorCount" : 13999,
    "errorPct" : 74.72909,
    "meanResTime" : 242.7432338653708,
    "medianResTime" : 72.0,
    "minResTime" : 0.0,
    "maxResTime" : 10999.0,
    "pct1ResTime" : 534.0,
    "pct2ResTime" : 1264.2999999999993,
    "pct3ResTime" : 1894.9799999999996,
    "throughput" : 520.5924855491329,
    "receivedKBytesPerSec" : 952.4751072091068,
    "sentKBytesPerSec" : 36.444230204743775
  },
  "Update Character" : {
    "transaction" : "Update Character",
    "sampleCount" : 18330,
    "errorCount" : 13731,
    "errorPct" : 74.90998,
    "meanResTime" : 249.88177850518142,
    "medianResTime" : 70.0,
    "minResTime" : 0.0,
    "maxResTime" : 11000.0,
    "pct1ResTime" : 478.0,
    "pct2ResTime" : 1261.4500000000007,
    "pct3ResTime" : 2002.6899999999987,
    "throughput" : 511.21151271753683,
    "receivedKBytesPerSec" : 934.7286607366967,
    "sentKBytesPerSec" : 38.725649124274874
  },
  "Get All Characters" : {
    "transaction" : "Get All Characters",
    "sampleCount" : 18934,
    "errorCount" : 14522,
    "errorPct" : 76.698006,
    "meanResTime" : 309.477183901974,
    "medianResTime" : 71.0,
    "minResTime" : 0.0,
    "maxResTime" : 10676.0,
    "pct1ResTime" : 898.0,
    "pct2ResTime" : 1478.0,
    "pct3ResTime" : 5306.6500000000015,
    "throughput" : 521.1097044090934,
    "receivedKBytesPerSec" : 7520.576403557961,
    "sentKBytesPerSec" : 26.04699734580558
  }
}