report_100_users/statistics.json
{
  "Get Character by ID" : {
    "transaction" : "Get Character by ID",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 2.6899999999999995,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 6.800000000000011,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 34.81999999999991,
    "throughput" : 102.88065843621399,
    "receivedKBytesPerSec" : 42.29761445473251,
    "sentKBytesPerSec" : 12.759612911522634
  },
  "Delete Character" : {
    "transaction" : "Delete Character",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 2.900000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 32.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 9.949999999999989,
    "pct3ResTime" : 31.869999999999933,
    "throughput" : 103.09278350515463,
    "receivedKBytesPerSec" : 42.68685567010309,
    "sentKBytesPerSec" : 21.4441043814433
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 500,
    "errorCount" : 400,
    "errorPct" : 80.0,
    "meanResTime" : 3.2260000000000004,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 25.930000000000064,
    "throughput" : 508.13008130081306,
    "receivedKBytesPerSec" : 187.27372332317074,
    "sentKBytesPerSec" : 93.17339145071138
  },
  "Create Character" : {
    "transaction" : "Create Character",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 2.629999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 33.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 10.899999999999977,
    "pct3ResTime" : 32.82999999999991,
    "throughput" : 102.6694045174538,
    "receivedKBytesPerSec" : 28.17392838809035,
    "sentKBytesPerSec" : 23.254018544661193
  },
  "Update Character" : {
    "transaction" : "Update Character",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 2.2300000000000004,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 17.97999999999999,
    "throughput" : 103.09278350515463,
    "receivedKBytesPerSec" : 42.38482603092783,
    "sentKBytesPerSec" : 24.152303479381445
  },
  "Get All Characters" : {
    "transaction" : "Get All Characters",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.68,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 13.900000000000006,
    "pct2ResTime" : 17.94999999999999,
    "pct3ResTime" : 37.87999999999994,
    "throughput" : 102.14504596527068,
    "receivedKBytesPerSec" : 33.91534729315628,
    "sentKBytesPerSec" : 12.668379724208377
  }
}