report_5000_users_duration/statistics.json
{
  "Get Character by ID" : {
    "transaction" : "Get Character by ID",
    "sampleCount" : 14619,
    "errorCount" : 14128,
    "errorPct" : 96.64136,
    "meanResTime" : 2571.5037964292924,
    "medianResTime" : 1134.0,
    "minResTime" : 1.0,
    "maxResTime" : 59229.0,
    "pct1ResTime" : 6218.0,
    "pct2ResTime" : 9457.0,
    "pct3ResTime" : 18085.8,
    "throughput" : 102.34814752583382,
    "receivedKBytesPerSec" : 221.18614179898623,
    "sentKBytesPerSec" : 2.6449832543966503
  },
  "Delete Character" : {
    "transaction" : "Delete Character",
    "sampleCount" : 12541,
    "errorCount" : 12158,
    "errorPct" : 96.946014,
    "meanResTime" : 2452.9709752013437,
    "medianResTime" : 1212.0,
    "minResTime" : 0.0,
    "maxResTime" : 59215.0,
    "pct1ResTime" : 5748.0,
    "pct2ResTime" : 9692.0,
    "pct3ResTime" : 14719.32,
    "throughput" : 87.8738193335015,
    "receivedKBytesPerSec" : 190.38830970467572,
    "sentKBytesPerSec" : 2.5552208472595925
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 72837,
    "errorCount" : 70431,
    "errorPct" : 96.69673,
    "meanResTime" : 2524.143580872375,
    "medianResTime" : 4203.5,
    "minResTime" : 0.0,
    "maxResTime" : 59229.0,
    "pct1ResTime" : 11463.800000000003,
    "pct2ResTime" : 14366.0,
    "pct3ResTime" : 36033.990000000005,
    "throughput" : 509.81311681948625,
    "receivedKBytesPerSec" : 2053.0139191769613,
    "sentKBytesPerSec" : 14.960087185903268
  },
  "Create Character" : {
    "transaction" : "Create Character",
    "sampleCount" : 15544,
    "errorCount" : 14940,
    "errorPct" : 96.11426,
    "meanResTime" : 2561.4008620689738,
    "medianResTime" : 1219.0,
    "minResTime" : 1.0,
    "maxResTime" : 59214.0,
    "pct1ResTime" : 5930.0,
    "pct2ResTime" : 9228.25,
    "pct3ResTime" : 17814.0,
    "throughput" : 108.84315633949767,
    "receivedKBytesPerSec" : 238.38882771635238,
    "sentKBytesPerSec" : 3.5273209652967905
  },
  "Update Character" : {
    "transaction" : "Update Character",
    "sampleCount" : 13633,
    "errorCount" : 13184,
    "errorPct" : 96.70652,
    "meanResTime" : 2490.3388102398612,
    "medianResTime" : 1098.0,
    "minResTime" : 1.0,
    "maxResTime" : 59212.0,
    "pct1ResTime" : 5706.400000000005,
    "pct2ResTime" : 9694.3,
    "pct3ResTime" : 18089.28,
    "throughput" : 95.51333249260863,
    "receivedKBytesPerSec" : 205.566153102099,
    "sentKBytesPerSec" : 3.736935105248224
  },
  "Get All Characters" : {
    "transaction" : "Get All Characters",
    "sampleCount" : 16500,
    "errorCount" : 16021,
    "errorPct" : 97.09697,
    "meanResTime" : 2529.110242424238,
    "medianResTime" : 1127.0,
    "minResTime" : 1.0,
    "maxResTime" : 58825.0,
    "pct1ResTime" : 6694.799999999999,
    "pct2ResTime" : 9162.849999999997,
    "pct3ResTime" : 14126.99,
    "throughput" : 115.57211700100862,
    "receivedKBytesPerSec" : 1198.892403781835,
    "sentKBytesPerSec" : 2.505813627703687
  }
}